Revit 2026 API

# RadioButtonGroupGetItems Method

---

Gets the collection of ToggleButtons assigned to the RadioButtonGroup.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ToggleButton> GetItems()
```
```vb
Public Function GetItems As IList(Of ToggleButton)
```
```cpp
public:
IList<ToggleButton^>^ GetItems()
```
```fsharp
member GetItems : unit -> IList<ToggleButton>
```

#### Return Value

IListToggleButton

This is a copy of all the ToggleButtons assigned to this group.

#### Reference

RadioButtonGroup Class

Autodesk.Revit.UI Namespace